<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string> A brief description of the software you will be packaging</string>
    <key>Identifier</key>
    <srting>com.github.tansharma.munki.Adapter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Adapter</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/adapter</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.macroplant.com/adapter/download-mac.php></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/adapter</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Adapter converts video, audio and images</string>
            <key>display_name</key>
            <string>Adapter</string>
            <key>name</key>
            </string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>Process</key>
    <array>
       <dict>
         <key>Processor</key>
         <string>URLDownloader</string>
         <key>Arguments</key>
         <dict>
            <key>url</key>
            <string>%DOWNLOAD_URL%</string>
            <key>filename</key>
            <string>%NAME%.dmg</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_path</key>
               <string>%pathname%</string>
               <key>repo_subdirectory</key>
               <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
