
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download and install Transmission.</string>
    <key>Identifier</key>
    <string>com.github.tansharma.install.Transmission</string>
    <key>Input</key>
    <dict>
        <key>DOWNLOAD_URL</key>
        <string>http://update.transmissionbt.com/appcast.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.tansharma.download.Transmission</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/Transmission.dmg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
