<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current release of Transmission and import into Munki.</string>
    <key>Identifier</key>
    <string>com.github.tansharma.munki.Transmission</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Transmission</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Transmission</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://update.transmissionbt.com/appcast.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Transmission is an open source, cross-platform BitTorrent client.</string>
            <key>display_name</key>
            <string>Transmission</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
	<string>com.github.tansharma.download.Transmission</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
